var Config = {
	getCategory(){
		return category;
	},
	getDescription(category){
		return description[category];
	},
	getQuestionare(category){
		return questionare[category];
	},
}

var category = ['心理测试', '亲戚问答'];
var description = {
	[category[0]]: {
		greet: '心理测试：15秒读出你的性格？注意：每题只能选择一个答案，应为你第一印象的答案'
	},
	[category[1]]: {
		greet: '过年了，避免不了的家庭聚会中，久未见面的七大姑八大姨又出现了，想要和你“唠唠嗑”'
	},
}
var questionare = {
	[category[0]]: {
		'host': '心理专家',
		'questions': [{
			'left': '你更喜欢吃那种水果？',
			'right': [{
				'msg': '草莓',
				'score': 2
			},{
				'msg': '苹果',
				'score': 3
			},{
				'msg': '西瓜',
				'score': 5
			},{
				'msg': '菠萝',
				'score': 10
			},{
				'msg': '橘子',
				'score': 15
			}]},{
			'left': '你平时休闲经常去的地方？',
			'right': [{
				'msg': '郊外',
				'score': 2
			},{
				'msg': '电影院',
				'score': 3
			},{
				'msg': '公园',
				'score': 5
			},{
				'msg': '商场',
				'score': 10
			},{
				'msg': '酒吧',
				'score': 15
			},{
				'msg': '练歌房',
				'score': 20
			}]},{
			'left': '你认为容易吸引你的人是？',
			'right': [{
				'msg': '有才气的人',
				'score': 2
			},{
				'msg': '依赖你的人',
				'score': 3
			},{
				'msg': '优雅的人',
				'score': 5
			},{
				'msg': '善良的人',
				'score': 10
			},{
				'msg': '性情豪放的人',
				'score': 15
			}]},{
			'left': '如果你可以成为一种动物，你希望自己是哪种？ ',
			'right': [{
				'msg': '猫',
				'score': 2
			},{
				'msg': '马',
				'score': 3
			},{
				'msg': '大象',
				'score': 5
			},{
				'msg': '猴子',
				'score': 10
			},{
				'msg': '狗',
				'score': 15
			},{
				'msg': '狮子',
				'score': 20
			}]},{
			'left': '天气很热，你更愿意选择什么方式解暑？',
			'right': [{
				'msg': '游泳',
				'score': 2
			},{
				'msg': '喝冷饮',
				'score': 3
			},{
				'msg': '开空调 ',
				'score': 5
			}]},{
			'left': '如果必须与一个你讨厌的动物或昆虫在一起生活，你能容忍哪一个？',
			'right': [{
				'msg': '蛇',
				'score': 2
			},{
				'msg': '猪',
				'score': 5
			},{
				'msg': '老鼠',
				'score': 10
			},{
				'msg': '苍蝇',
				'score': 15
			}]},{
			'left': '你喜欢看哪类电影、电视剧？',
			'right': [{
				'msg': '悬疑推理类',
				'score': 2
			},{
				'msg': '童话神话类',
				'score': 3
			},{
				'msg': '自然科学类',
				'score': 5
			},{
				'msg': '伦理道德类',
				'score': 10
			},{
				'msg': '战争枪战类',
				'score': 15
			}]},{
			'left': '以下哪个是你身边必带的物品？',
			'right': [{
				'msg': '打火机',
				'score': 2
			},{
				'msg': '口红',
				'score': 3
			},{
				'msg': '记事本',
				'score': 5
			},{
				'msg': '纸巾',
				'score': 10
			},{
				'msg': '手机',
				'score': 15
			}]},{
			'left': '你出行时喜欢坐什么交通工具？',
			'right': [{
				'msg': '火车',
				'score': 2
			},{
				'msg': '自行车',
				'score': 3
			},{
				'msg': '汽车',
				'score': 5
			},{
				'msg': '飞机',
				'score': 10
			},{
				'msg': '步行',
				'score': 15
			}]},{
			'left': '以下颜色你更喜欢哪种？',
			'right': [{
				'msg': '紫',
				'score': 2
			},{
				'msg': '黑',
				'score': 3
			},{
				'msg': '蓝',
				'score': 5
			},{
				'msg': '白',
				'score': 8
			},{
				'msg': '黄',
				'score': 12
			},{
				'msg': '红',
				'score': 15
			}]},{
			'left': '下列运动中挑选一个你最喜欢的（不一定擅长）？ ',
			'right': [{
				'msg': '瑜珈',
				'score': 2
			},{
				'msg': '自行车',
				'score': 3
			},{
				'msg': '乒乓球',
				'score': 5
			},{
				'msg': '拳击',
				'score': 8
			},{
				'msg': '足球',
				'score': 10
			},{
				'msg': '蹦极',
				'score': 15
			}]},{
			'left': '如果你拥有一座别墅，你认为它应当建立在哪里？',
			'right': [{
				'msg': '湖边',
				'score': 2
			},{
				'msg': '草原',
				'score': 3
			},{
				'msg': '海边',
				'score': 5
			},{
				'msg': '森林',
				'score': 10
			},{
				'msg': '城中区',
				'score': 15
			}]},{
			'left': '你更喜欢以下哪种天气现象？',
			'right': [{
				'msg': '雪',
				'score': 2
			},{
				'msg': '风',
				'score': 3
			},{
				'msg': '雨',
				'score': 5
			},{
				'msg': '雾',
				'score': 10
			},{
				'msg': '雷电',
				'score': 15
			}]},{
			'left': '你希望自己的窗口在一座30层大楼的第几层？',
			'right': [{
				'msg': '七层',
				'score': 2
			},{
				'msg': '一层',
				'score': 3
			},{
				'msg': '二十三层',
				'score': 5
			},{
				'msg': '十八层',
				'score': 10
			},{
				'msg': '三十层',
				'score': 15
			}]},{
			'left': '你认为自己更喜欢在以下哪一个城市中生活？',
			'right': [{
				'msg': '丽江',
				'score': 2
			},{
				'msg': '拉萨',
				'score': 3
			},{
				'msg': '昆明',
				'score': 5
			},{
				'msg': '西安',
				'score': 8
			},{
				'msg': '杭州',
				'score': 10
			},{
				'msg': '北京',
				'score': 15
			}]}
		],
		'result': [{
			'score': 180,
			'msg': '意志力强，头脑冷静，有较强的领导欲，事业心强，不达目的不罢休。外表和善，内心自傲，对有利于自己的人际关系比较看重，有时显得性格急噪，咄咄逼人，得理不饶人，不利于自己时顽强抗争，不轻易认输。思维理性，对爱情和婚姻的看法很现实，对金钱的欲望一般',
			'suggestion': '改改自己的脾气吧，柔和一点'
		},{
			'score': 140,
			'msg': '聪明，性格活泼，人缘好，善于交朋友，心机较深。事业心强，渴望成功。思维较理性，崇尚爱情，但当爱情与婚姻发生冲突时会选择有利于自己的婚姻。金钱欲望强烈。',
			'suggestion': '不要算计太多会更快乐'
		},{
			'score': 100,
			'msg': '爱幻想，思维较感性，以是否与自己投缘为标准来选择朋友。性格显得较孤傲，有时较急噪，有时优柔寡断。事业心较强，喜欢有创造性的工作，不喜欢按常规办事。性格倔强，言语犀利，不善于妥协。崇尚浪漫的爱情，但想法往往不切合实际。金钱欲望一般。',
			'suggestion': '孤傲的小精灵'
		},{
			'score': 70,
			'msg': '好奇心强，喜欢冒险，人缘较好。事业心一般，对待工作，随遇而安，善于妥协。善于发现有趣的事情，但耐心较差，敢于冒险，但有时较胆小。渴望浪漫的爱情，但对婚姻的要求比较现实。不善理财。',
			'suggestion': '你不理财财不理你哦，有时大胆一点'
		},{
			'score': 40,
			'msg': '性情温良，重友谊，性格塌实稳重，但有时也比较狡黠。事业心一般，对本职工作能认真对待，但对自己专业以外事物没有太大兴趣，喜欢有规律的工作和生活，不喜欢冒险，家庭观念强，比较善于理财。',
			'suggestion': '简简单'
		},{
			'score': 0,
			'msg': '散漫，爱玩，富于幻想。聪明机灵，待人热情，爱交朋友，但对朋友没有严格的选择标准。事业心较差，更善于享受生活，意志力和耐心都较差，我行我素。有较好的异性缘，但对爱情不够坚持认真，容易妥协。没有财产观念。',
			'suggestion': '快乐'
		}]	
	},
	[category[1]]: {
		'host': '大姑妈',
		'questions': [{
			'left': '工作找得怎么样？',
			'right': [{
				'msg': '已经尽力在找了，应该马上就有机会了',
				'score': 2
			},{
				'msg': '我觉得做什么工作都好，生活还是重在经历和感悟，您说是吧?',
				'score': 3
			},{
				'msg': '还可以，对了，您孩子期末排第几啊?听说现在择校费挺贵的。',
				'score': 5
			}]},{
			'left': '大城市消费水平高吧，每个月赚多少钱啊？',
			'right': [{
				'msg': '也就是平均水平，存了点钱，给爸妈发发红包。',
				'score': 2
			},{
				'msg': '我们工资不固定，根据绩效拿，时多时少，我也没算过。',
				'score': 3
			},{
				'msg': '养活自己没问题，最近听说退休金又涨了，您现在能拿到多少了?',
				'score': 5
			}]},{
			'left': '年终奖发了多少？',
			'right': [{
				'msg': '我们过完年之后才发呢，现在我也不知道。',
				'score': 2
			},{
				'msg': '我们入职的时候都签了保密协议，不能说的。',
				'score': 3
			},{
				'msg': '现在八项规定抓得严，这个问题比较敏感……(音量放低做神秘状)',
				'score': 5
			}]},{
			'left': '有女朋友/男朋友了吗？',
			'right': [{
				'msg': '现在主要忙工作，多赚点儿钱，女生跟着自己不能让人家吃亏。',
				'score': 2
			},{
				'msg': '追求者太多了，还没选好呢。',
				'score': 3
			},{
				'msg': '想找个像爸爸/妈妈一样好的，真是太难了!(充满柔情地望向自己父母)',
				'score': 5
			}]},{
			'left': '什么时候结婚？',
			'right': [{
				'msg': '遇到合适的，时机成熟就结婚',
				'score': 2
			},{
				'msg': '让我考虑几年再回答。',
				'score': 3
			},{
				'msg': '我去山里让大和尚算过了，时候未到，天机不可泄露。(表情要真诚) ',
				'score': 5
			}]},{
			'left': '买房了吗？',
			'right': [{
				'msg': '存款能买一个洗手间了',
				'score': 2
			},{
				'msg': '看上好几套，地段都还行，周边有学校，没想好选哪个',
				'score': 3
			},{
				'msg': '哎对，您给孩子准备婚房了没?',
				'score': 5
			}]},{
			'left': '什么时候要孩子？',
			'right': [{
				'msg': '攒够奶粉钱就要',
				'score': 2
			},{
				'msg': '爱情的结晶需要慢慢经营，顺其自然',
				'score': 3
			},{
				'msg': '阿姨吃菜吃菜，多吃点儿!',
				'score': 5
			}]},{
			'left': '什么时候要二胎？',
			'right': [{
				'msg': '养一个就够累啦，等他/她大一点儿吧。',
				'score': 2
			},{
				'msg': '单位活儿太多，抽不出空啊。',
				'score': 3
			},{
				'msg': '那得问他/她啊(望向孩子)，哎呀又弄脏了妈妈带你去洗手',
				'score': 5
			}]},{
			'left': '吃啊吃啊你怎么不吃，你是不是怕胖在减肥？',
			'right': [{
				'msg': '我两个小时之前吃的午饭实在吃不下了',
				'score': 2
			},{
				'msg': '阿姨您也吃，您血压血糖都还正常吧?叔叔的脂肪肝好点儿了吗?',
				'score': 3
			},{
				'msg': '之前上火，口腔溃疡/舌头起泡/牙龈发炎，一吃东西就疼。',
				'score': 5
			}]},{
			'left': '不认识我了吗，小时候我还抱过你呢？',
			'right': [{
				'msg': '叔叔/阿姨，您身体挺好的吧',
				'score': 2
			},{
				'msg': '您还是这么年轻，远看都没敢认',
				'score': 3
			},{
				'msg': '哎呀，这么多年过去了，您现在该抱孙子了吧',
				'score': 5
			}]}
		],
		'result': [{
			'score': 40,
			'msg': '你这个孩子...',
			'suggestion': '哈哈，你很机智，可以顺利过年啦'
		},{
			'score': 15,
			'msg': '真是个听话的小孩',
			'suggestion': '中规中矩也还是可以自保的'
		},{
			'score': 0,
			'msg': '呵呵',
			'suggestion': '要加油呀，情商余额不足！'
		}]	
	}
}












// var data = {
// 	'questions': [{
// 		'left': '13213',
// 		'right': [{
// 			'msg': '1231',
// 			'score': 1
// 		},{
// 			'msg': '1231',
// 			'score': 2
// 		},{
// 			'msg': '1231',
// 			'score': 3
// 		}]},{
// 		'left': '11111',
// 		'right': [{
// 			'msg': '324654',
// 			'score': 3
// 		}]},{'left': '54455',
// 		'right': [{
// 			'msg': '4545',
// 			'score': 3
// 		}]}],
// 	'result': [{
// 		'score': 10,
// 		'msg': '呵呵'
// 	},{
// 		'score': 4,
// 		'msg': '不错继续努力'
// 	}]		
// };